class Topics{
    constructor(introduce,teacher,leader,members){
        this.introduce = introduce;
        this.teacher = "指導老師: " + teacher + "老師";
        this.leader = "組長: " + leader;
        this.members = "組員: " + members;
    }
}
//水之旅
var game_01 = 
new Topics("水除了以氣體形式存在於大氣中,液體和固體形式占據了地面70-75%的組成部分,水也是任何有生命的生物或植物所需要的重要資源，並且型態千變萬化，能變成氣態、液態、固態，而我們從中發現遊戲的發想。",
"劉欽豪",
"林亭萱",
"黃珮芳、林玉茹、施旻翰、劉彥廷、葉佳彥")

//TraceBack
var game_02 = 
new Topics("急診室醫生在某天意外死亡，靈魂來到了冥府，在看到冥府不成文的規定後打算和小精靈一同造反，天王們利用聲望之力幻化成痛苦記憶裡的主謀來與他戰鬥，在這期間見證了他戰勝生前令他痛苦的回憶，一步一步成為音樂神。",
"巫俊采",
"李芝璇",
"張馨予、江欣諭、許博雯、陳佳禎、黃冠綸")

//STAR DRIFT
var game_03 = 
new Topics("古神在預言了天幻星系將與裂空星系相遇並碰撞結合，為此派遣星星使者各鎮守三顆形成氣泡雲的寶石。然而，預言之日來臨時，一股來自裂空星系的未知力量導致計畫脫軌，寶石失散各地，造成氣泡雲瓦解，天幻星系暴露在無法適應的暗射線下，生態受到汙染及影響，而背負使命的法瑪，開始了探索的旅程。",
"彭慶東",
"游婷翊",
"康庭維、袁宜茜、洪語襄、陳建璋、賴哲弘")

//絕種危機
var game_04 = 
new Topics("《絕種危機》以VR為載體讓，您身臨其境地成為一位台灣保育員。穿越台灣的原始森林，追蹤野放的黑熊、解救動物、清除陷阱。在挑戰中體會野生動物的生存之旅，用相機紀錄動物，希望能激發玩家為野生動物出一份心力。",
"巫俊采",
"蔡佩妤",
"郭岱昀、楊士弦、賴冠佐、張育誠、楊珮瑄")

//淨旅
var game_05 = 
new Topics("地球在經歷數個文明毀滅後，擁有與靈和大自然緊繫的「傾聽者」誕生了，因能感知到舊時代遺留的徬徨靈魂，背負起引導生命回到該有軌道的使命，他們將踏上圓滿未完心願的旅程。",
"吳柏瀧",
"林喨瑩",
"邱郁婷、林婉茜、徐卉菱、王虹惟、陸子欣")

//Cat
var game_06 = 
new Topics("以貓咪為主角，地下城為故事背景的Boss Rush遊戲。",
"吳柏瀧老師、蘇禧鑫",
"賴彩浠",
"蔡宜蓁、楊硯勻")

//Aurora
var game_07 = 
new Topics("",
"",
"",
"")

//魔靈騎士
var game_08 = 
new Topics("以我們2D橫向像素風格來呈現擊殺小怪升級養成角色並在過程中隨機獲得神器或探索地圖取得技能遇見隨機BOSS等多樣化的玩法，帶給玩家每把遊戲相對不同的體驗。",
"巫俊采",
"林劭儒",
"蔡欣妤、陳珮珊、陳昱辰、鄭敬諺")

//冒險者
var game_09 = 
new Topics("人與魔物共同生存在這充滿魔法和冒險的世界中，而一位新手冒險者──保羅正朝著頂級冒險者的目標前進！一路上他將邂逅各種夥伴，是敵？是友？只要你也有一顆熱衷冒險的心，就加入我們吧！",
"吳柏瀧",
"林子揚",
"曾鈞鴻、楊凱、莊俊彥、黃筱瑄")

//流星
var game_10 = 
new Topics("你將扮演一個暱稱星河的有名直播主，結束直播出門買宵夜時卻在路上失去了意識。醒來就到了一個跟自己的房間很相似的地方，你出了房間後發現這是一個無人的大宅。但他的主人只是暫時不在，你需要在主人回來前找到方法逃出，不然 ...... 會發生什麼呢？",
"吳柏瀧",
"鄭雨晏",
"張之凡、廖育萱、陳盈慈、劉佾函、花思羽")

//夢魘綠野
var game_11 = 
new Topics("",
"",
"",
"")

//星與雨
var animation_01 = 
new Topics("我們是每個人作的白日夢裡出現的星星，夢幻又閃爍的存在，吸引人們目光與注意力，也有令人靈光一閃的感覺，這個名字也代表無限可能性與美好的未來。我們曾創作過以星星代替燈泡和溫暖的治癒小動畫，希望讓人們在緊湊的生活中喘口氣，多看看其他的景色。本作品將以其為基礎衍生聯想，溫暖的星星，將繼續傳遞生活中那些 意外的小確幸。",
"廖偉智",
"彭楦柔",
"陳雅娟、劉依靜、陳柔磬")

//Play again
var animation_02 = 
new Topics("在現代，許多人都沈迷於網路，人們大多會選擇用網路上的美好，來逃避在現實中的痛苦。我們創作這故事目的是想表達為何人會網路成癮？  以及讓觀眾們想想如果自己是主角們其中㇐人的話，會選擇留在網路世界上嗎？還是會選擇回去面對現實？",
"吳崇榮",
"宋怡萱",
"閻景頤、張琇婷、陳卉祐、周思萍、葉佩宣")

//FLOAT
var animation_04 = 
new Topics("浮動的夢想，可以是指引也可以是牽絆。當那名為夢想的氣球突破天際時，安全降落與灑脫翱翔卻成了人生中重大的選擇題。",
"吳崇榮",
"賴品綸",
"林詩雅、陳佳霈、李芯绮、王偉宸、蔡佳珉")

//願之神社
var animation_05 = 
new Topics("這次專題中我們創造了一個屬於我們自己的虛擬角色名叫「新輝」，我們會將新輝的背景故事以3D動畫的方式呈現，也會在youtube平台上開設直播，如果有興趣也歡迎追蹤我們的IG與yt。",
"周玄祥、廖偉智",
"賴姵蓉",
"賴癸坊、郭乃瑜、蕭翔逸、林庭煒")

//RE_PLACE
var animation_06 = 
new Topics("我們是吉飛狗跳動畫工作室吉娃娃代表永不畏懼故事描繪出家庭暴力中，仿生人試圖插手幫助人類，但未成功而釀出災難，最終卻因非人類的身分，而被大眾誤會為事件主導者探討如家庭暴力、人工智慧倫理、人類情感等主題。",
"廖偉智",
"黃燕翎",
"陳品妘、李家誠、張景翔、謝佳鴻、張子謙")

//囚偶
var animation_07 = 
new Topics("有好歉 have well and sorry先求有 再求好 最後再道歉-嶺東科技大學第21屆數位媒體設計系-<囚偶>2D動畫組 畢業製作",
"楊欣儒",
"張嘉云",
"林宸卉、章芯誼、陳志佑")

//垃此不疲
var animation_08 = 
new Topics("故事描述被丟棄的寶寶枕頭，踏上尋找自我價值的旅程來到了靈界市集，雖然並沒有成為想要的樣子，但卻發現了自己的價值。",
"楊欣儒",
"黃郁琇",
"王薏惠、謝佳芳、游叡雯、陳竑瑜、陳庭")

//夜朦朧
var animation_09 = 
new Topics("",
"",
"",
"")

//線
var animation_10 = 
new Topics("極致追求駕馭某件事情到達極限、到達極致，或者是被極端化的性質或狀態，不然就是極端的措施或主見以極簡抽象表達物體最原始之線條。動畫也能用另外的形式表達藝術，不再是拘束於劇情說故事，畫風也能呈現故事，專注於創造主題核心身分。",
"劉欽豪",
"連宇陽",
"夏昱羚、謝凱婷、蔡欣妤、何怡萱")

//紅心馬戲團
var animation_11 = 
new Topics("《紅心馬戲團》敘述卡蘿初次表演失敗，卻透過神秘VR眼鏡找回勇氣，重返馬戲團舞台。她在虛擬世界中克服內心的恐懼，完成高難度的表演，最終發現紅心兔竟是她自己。這感動人心的故事描繪了勇氣、自信和追夢的旅程。",
"陳子雲",
"黃新惠",
"黃芫慧、黃玟瑞、林宜臻、陳予捷、劉品萱")

//那年回家
var movie_01 = 
new Topics("",
"",
"",
"")

//記憶謊言
var movie_02 = 
new Topics("人的記憶如謊言般諷刺，隨時都能夠 被他人的幾句話而被竄改，夢境也是， 你所看到的夢境，真的是實的?還是 一切都是虛構?",
"林世勇",
"莊翌柔",
"林玟嫺、吳貴彬、邢宸宇、樊嘉寶")

//泥沼
var movie_03 = 
new Topics("主角瑞銘在面臨到自己的阿嬤被詐騙後，不理解的他為了幫阿嬤善後，意外的加入到一份高薪的工作，但隨著工作的深入，卻發現這份工作與家裡的狀況好像似曾相似...",
"洪瑞陽",
"黃登緯",
"林俊憲、周宜楹、陳宜萱")

//離別沒有吉時
var movie_04 = 
new Topics("明清久違的回老家辦事，家人卻對明清不理不睬，好似根本看不見明清；疑惑中的明清這才發現家中正在舉辦自己的葬禮......明清會說些什麼?在離開前還能做點什麼?又該怎麼做才算是好好的說再見呢？",
"洪瑞陽",
"黎九麟",
"王莉庭、盧柏廷、魏子翰、蔡沛凌、鄭羽芹")

//逃避的爛人
var movie_05 = 
new Topics("大家都有遇過爛人吧？身邊都有那幾顆老鼠屎，最可惡的是還沒辦法拿他們怎樣，因為他們總是避著問題不談，正大光明地生活著。正因為組上真的發生過這種鳥事，決定做一首mv來好好譴責這種「逃避的爛人」，也誠摯地歡迎大家一起跟我們狂歡！",
"林世勇",
"高雅鈊",
"高京翎、黃筱菁、劉芫菁、楊賀麟、徐凡崴")

//好想
var movie_06 = 
new Topics("在相同的臉上，有著不曾相似的風霜。是否，訴說著相逢何必曾相識？好想，因為未曾有過這樣般的悸動 總是，浪打空城寂寞回 何必，月光照應單影相對 只好，黎明再相見。",
"黃冠瑋",
"李建明",
"王晨蘐、賈宗緯、周孟澤、許綵蘭")

//懷戀
var movie_07 = 
new Topics("過去是如此令人著迷，有人懷念過去，為了留下回憶，”舊物”產業也油然而生。本片採訪從事舊物相關產業的人，聚焦於他們從收藏到今日他們的事業，也同時簡要介紹跳蚤市場與舊物市集的故事。",
"靳鐵章",
"尹修倫",
"無")